pkg/wsman/wsmantesting/responses/amt/messagelog/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_MessageLog"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>5</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-00000000271E</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_MessageLog</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:AMT_MessageLog>
            <g:Capabilities>5</g:Capabilities>
            <g:Capabilities>6</g:Capabilities>
            <g:Capabilities>8</g:Capabilities>
            <g:Capabilities>7</g:Capabilities>
            <g:CharacterSet>10</g:CharacterSet>
            <g:CreationClassName>AMT_MessageLog</g:CreationClassName>
            <g:CurrentNumberOfRecords>390</g:CurrentNumberOfRecords>
            <g:ElementName>Intel(r) AMT:MessageLog 1</g:ElementName>
            <g:EnabledDefault>2</g:EnabledDefault>
            <g:EnabledState>2</g:EnabledState>
            <g:HealthState>5</g:HealthState>
            <g:IsFrozen>false</g:IsFrozen>
            <g:LastChange>0</g:LastChange>
            <g:LogState>4</g:LogState>
            <g:MaxLogSize>0</g:MaxLogSize>
            <g:MaxNumberOfRecords>390</g:MaxNumberOfRecords>
            <g:MaxRecordSize>21</g:MaxRecordSize>
            <g:Name>Intel(r) AMT:MessageLog 1</g:Name>
            <g:OperationalStatus>2</g:OperationalStatus>
            <g:OverwritePolicy>2</g:OverwritePolicy>
            <g:PercentageNearFull>100</g:PercentageNearFull>
            <g:RequestedState>12</g:RequestedState>
            <g:SizeOfHeader>0</g:SizeOfHeader>
            <g:SizeOfRecordHeader>0</g:SizeOfRecordHeader>
            <g:Status>OK</g:Status>
        </g:AMT_MessageLog>
    </a:Body>
</a:Envelope>